sample-xml/amendment_cancelsubscription_v1_v24/cancel_request.xml


<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><ns1:SessionHeader xmlns:ns1="http://api.zuora.com/" soapenv:mustUnderstand="0"><ns1:session>oaw1LI6AZtrUZ/EkXb6cfp/2TR+luU/kbJ0sKsC6YWCT8088/oohooqR/oCk6tj4BH+HAZ4GUn7Lr4qsY9Br1zP5IkEHD/9uvgRlhT3LSP6lRfSKybWJkg==</ns1:session></ns1:SessionHeader></soapenv:Header><soapenv:Body><ns1:create xmlns:ns1="http://api.zuora.com/"><ns1:zObjects xmlns:ns2="http://object.api.zuora.com/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:Amendment"><ns2:EffectiveDate>2009-02-08T16:12:48.312-08:00</ns2:EffectiveDate><ns2:SubscriptionId>402828f21eb8bbc8011eb8bbe2790046</ns2:SubscriptionId><ns2:Type>Cancellation</ns2:Type></ns1:zObjects></ns1:create></soapenv:Body></soapenv:Envelope>
